In [1]:
#DataFrames

In [3]:
import numpy as np
import pandas as pd

In [4]:
data={'apples':[3,2,0,1],'oranges':[0,3,7,2]}
purchases=pd.DataFrame(data)
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [8]:
#custom indexes

purchases=pd.DataFrame(data,index=['madhu','mitran','anil','jai'])
purchases

        apples  oranges
madhu        3        0
mitran       2        3
anil         0        7
jai          1        2

In [10]:
purchases.loc['madhu']

apples     3
oranges    0
Name: madhu, dtype: int64

In [11]:
purchases.loc['mitran']

apples     2
oranges    3
Name: mitran, dtype: int64

In [12]:
#data sets implementation,reading data in different formats

df=pd.read_csv('purchases.csv')
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [18]:
#ignoring system generated indexes


df=pd.read_csv('purchases.csv',index_col=0)
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [19]:
#reading JSON file


jf=pd.read_json('purchases.json')
jf

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [21]:
#save/store files


jf.to_json('new_purchases.json')
df.to_csv('new_purchaeses.csv')